#Задание_1
var_1 = 1
var_2 = 9
name = input("Как вас зовут?")
human_var_1 = input("Введите число: ")
human_var_2 = input("Введите ваше любимое слово:")
print(name + ' , твое любимое число - ' + human_var_1 +', любимое слово -' + human_var_2)

